Revit 2024 API
CurtainGrid.Grid1Justification Property
The justification for the U grid line pattern of the curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurtainGridAlignType Grid1Justification { get; set; }
Visual Basic
Public Property Grid1Justification As CurtainGridAlignType
	Get
	Set
Visual C++
public:
property CurtainGridAlignType Grid1Justification {
	CurtainGridAlignType get ();
	void set (CurtainGridAlignType value);
}
See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace